{"config": [{"config": {"output_shape": null, "name": "lambda_2", "function_type": "lambda", "input_dtype": "float32", "output_shape_type": "raw", "trainable": true, "batch_input_shape": [null, 16, 32, 1], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-11-600bd4814c1e>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}}, "class_name": "Lambda"}, {"config": {"b_constraint": null, "activity_regularizer": null, "name": "convolution2d_3", "nb_row": 3, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "activation": "relu", "nb_filter": 16, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "subsample": [1, 1], "nb_col": 3, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_3", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activity_regularizer": null, "name": "convolution2d_4", "nb_row": 3, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "activation": "relu", "nb_filter": 32, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "subsample": [1, 1], "nb_col": 3, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_4", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": 384, "activity_regularizer": null, "trainable": true, "bias": true, "output_dim": 1, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.2"}